logs/fio-diskrnd/bridge-operator/001/log004.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;87146;340;96259;0;0;0.000000;0.000000;95;70690;2924.738583;5295.752297;1.000000%=97;5.000000%=99;10.000000%=101;20.000000%=112;30.000000%=115;40.000000%=119;50.000000%=146;60.000000%=179;70.000000%=207;80.000000%=8585;90.000000%=10551;95.000000%=12517;99.000000%=23724;99.500000%=30801;99.900000%=32899;99.950000%=32899;99.990000%=38535;0%=0;0%=0;0%=0;98;70693;2928.653241;5295.503680;9216;1241600;99.214345%;86461.333333;120496.351605;0.194270%;5.139313%;8589;0;224;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;6.47%;67.35%;0.13%;0.01%;0.00%;0.20%;0.02%;15.44%;9.14%;1.24%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;2;20705;0;0;14;330154;330168;93.70%;slaves;2;30072;0;118;14;336917;337569;99.46%;sda;2;30072;0;118;14;336917;337569;99.46%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=91480: Fri Dec  1 19:19:19 2023
  write: IOPS=340, BW=85.1MiB/s (89.2MB/s)(8192MiB/96259msec); 0 zone resets
    clat (usec): min=95, max=70690, avg=2924.74, stdev=5295.75
     lat (usec): min=98, max=70693, avg=2928.65, stdev=5295.50
    clat percentiles (usec):
     |  1.00th=[   98],  5.00th=[  100], 10.00th=[  102], 20.00th=[  113],
     | 30.00th=[  116], 40.00th=[  120], 50.00th=[  147], 60.00th=[  180],
     | 70.00th=[  208], 80.00th=[ 8586], 90.00th=[10552], 95.00th=[12518],
     | 99.00th=[23725], 99.50th=[30802], 99.90th=[32900], 99.95th=[32900],
     | 99.99th=[38536]
   bw (  KiB/s): min= 9216, max=1241600, per=99.21%, avg=86461.33, stdev=120496.35, samples=192
   iops        : min=   36, max= 4850, avg=337.74, stdev=470.69, samples=192
  lat (usec)   : 100=6.47%, 250=67.35%, 500=0.13%, 750=0.01%
  lat (msec)   : 2=0.20%, 4=0.02%, 10=15.44%, 20=9.14%, 50=1.24%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.19%, sys=5.14%, ctx=8589, majf=0, minf=224
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=85.1MiB/s (89.2MB/s), 85.1MiB/s-85.1MiB/s (89.2MB/s-89.2MB/s), io=8192MiB (8590MB), run=96259-96259msec

Disk stats (read/write):
    dm-0: ios=2/20705, merge=0/0, ticks=14/330154, in_queue=330168, util=93.70%, aggrios=2/30072, aggrmerge=0/118, aggrticks=14/336917, aggrin_queue=337569, aggrutil=99.46%
  sda: ios=2/30072, merge=0/118, ticks=14/336917, in_queue=337569, util=99.46%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;276742;1081;30312;0;0;0.000000;0.000000;597;18357;921.733793;417.142347;1.000000%=774;5.000000%=798;10.000000%=806;20.000000%=815;30.000000%=839;40.000000%=847;50.000000%=856;60.000000%=864;70.000000%=872;80.000000%=905;90.000000%=954;95.000000%=978;99.000000%=2473;99.500000%=3751;99.900000%=5275;99.950000%=5537;99.990000%=16056;0%=0;0%=0;0%=0;597;18357;921.957515;417.144545;84992;301056;99.933078%;276556.800000;58669.490514;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.583946%;14.248953%;32788;0;286;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.27%;95.36%;1.79%;2.38%;0.18%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;32582;1607;0;0;25299;6619;31918;99.61%;slaves;32780;2699;0;6;25819;6291;32120;99.97%;sda;32780;2699;0;6;25819;6291;32120;99.97%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=91938: Fri Dec  1 19:19:49 2023
  read: IOPS=1081, BW=270MiB/s (283MB/s)(8192MiB/30312msec)
    clat (usec): min=597, max=18357, avg=921.73, stdev=417.14
     lat (usec): min=597, max=18357, avg=921.96, stdev=417.14
    clat percentiles (usec):
     |  1.00th=[  775],  5.00th=[  799], 10.00th=[  807], 20.00th=[  816],
     | 30.00th=[  840], 40.00th=[  848], 50.00th=[  857], 60.00th=[  865],
     | 70.00th=[  873], 80.00th=[  906], 90.00th=[  955], 95.00th=[  979],
     | 99.00th=[ 2474], 99.50th=[ 3752], 99.90th=[ 5276], 99.95th=[ 5538],
     | 99.99th=[16057]
   bw (  KiB/s): min=84992, max=301056, per=99.93%, avg=276556.80, stdev=58669.49, samples=60
   iops        : min=  332, max= 1176, avg=1080.30, stdev=229.18, samples=60
  lat (usec)   : 750=0.27%, 1000=95.36%
  lat (msec)   : 2=1.79%, 4=2.38%, 10=0.18%, 20=0.02%
  cpu          : usr=0.58%, sys=14.25%, ctx=32788, majf=0, minf=286
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=270MiB/s (283MB/s), 270MiB/s-270MiB/s (283MB/s-283MB/s), io=8192MiB (8590MB), run=30312-30312msec

Disk stats (read/write):
    dm-0: ios=32582/1607, merge=0/0, ticks=25299/6619, in_queue=31918, util=99.61%, aggrios=32780/2699, aggrmerge=0/6, aggrticks=25819/6291, aggrin_queue=32120, aggrutil=99.97%
  sda: ios=32780/2699, merge=0/6, ticks=25819/6291, in_queue=32120, util=99.97%